üí≠Tables: [https://viewer.diagrams.net](https://viewer.diagrams.net/?tags=%7B%7D&highlight=0000ff&layers=1&nav=1#R7V1bc5s4FP41mWkfnBF3eHSTtpvdpJekm15ePDLINi0BF8tNnF%2B%2FAgQGSTYYC9vxeqc7LUI3pE%2Bfzjk6Rz7TLh6e3sdwOrmJPBScqcB7OtMuz1RVtSyd%2FJWkLLIUxVSVLGUc%2Bx5NWybc%2Bc%2BIJgKaOvc9NKtkxFEUYH9aTXSjMEQurqTBOI4eq9lGUVBtdQrHiEu4c2HAp371PTzJUm3VWqb%2FhfzxJG9ZMZ3szQPMM9MvmU2gFz2WkrS3Z9pFHEU4%2B9fD0wUKktHLxyUr927F26JjMQpxkwJPdvD59xz%2B0u%2BvjA%2BzD4Zx9VPr0Vr%2BwGBOP%2Fgimoc4XtA%2B40U%2BELNH%2FyGAIXl64078wLuGi2ieNDzD0P2VP72ZRLH%2FHIUYBuSVQhLI6xjTeTVAJcddUpIkJ6kxadZDHi00Iu9pGUXPn2lfQFppHP0qJkRNyqMZyf8pHw1QJF3DGc67ks9A8taDs0naXvIAA38ckn%2B7pDSKk4TYpe0nzT9OfIzuptBNEh4J0pPPwA%2F5J478ILiIgihOR0ob2S5y3aKXpTdD29DTMeDnLp8IFGP0VEqic%2FkeRQ8onRZA3%2FY0jQKLLq2e6tCExyVQlTxtUgEpTYR0cYyL2pf4If%2BgENoATioHpzPVDDCdwXSZ5oNh%2Fp4nyCdDoQHyHxmwUpI5Tv6mUBxcXea1kE5lFWUZXl19%2BPI6fzeM2XIhfECv7vu3F3%2F1b0nbivGaQ3U%2B8QEaYW7GwiiFe3l6adKMYMEPx9dpqUudQWyCx2QifUIjfdoAjqY5JOGwwHEcYYhLzwQROVhL%2BOLRsnYt10OIIsZoiBezK7jkOCzTTzAfnrinNfcMFc8bAQ7J5I0CLM1BkrjHYahH0QRQskXUo3aGJX4r24p7CA5XE0%2FTmjWNr7lCWivqLXFZ0g%2BGyDQgID2Cdc%2BfP2R5%2FxAMTWD8yliX04UJi%2BFFkVsFr4%2BcIUFjpK%2BhSBGuLQmw9m%2F6gfdjfPPtGj%2FH08XztHd3X3S5NCPIIxIqfYxiPInGUQiDt8vUEqElQ7bMcx0lY5yO2E%2BE8YJOB5zjqDqe6MnH35Li5wZ9%2Bl56c%2FlEa04fFvRhwzmYRfPYRQ0WNOHwMVpbI82YjMvaOY1RALH%2FpyrZyyciXgi6Q3AWhadtrfW25gEXIVW0rRmmoViStjVGoBatfVOw9p3OtjRN6paWoXBjafo7IltD9uqYtwa1MVo2hIfeGTz0lUQDrsJRdOKb9io89BzPEPENRLqiqXL4RrVZMVqkwVsCTBXgkw8qoxPOIXDcmHiatDsaAZCM4qZctzsBfpuvWK%2BENBu25frPax9GsYfiHu1JP53s%2BFWvV05%2FnVVU9Gezfl8jOJ6jjXt%2BR9DobQGGVRPWJ0sSjtEgMfWu6NAoiCB%2B9VrQ8LsoJgsvHEwDuEDx7JUfYkGuvIkHGP9CuNCoFFVU5ReycQXNsl6FblTS58SZPpLGh5Awu1uX8%2B3TFIWej%2BdxXc5bGP5aORXHLAfojVl8jRwg5GzQGWdbHGdfRNCdnASAA7fhWxYjABR2hDp7Q3c6h916%2Fx%2BNRCZ8gsMWBvykFGP10sGRayBWY%2FhsaJzqTANReWGREg%2Fokf9P2ogkMhqNVDEZeebQNEw5ZGQAhow0fd8GENVsRUZ1SsGulZFmJHjE1FbwxMsxrqi8THXvu5hQDZqdqKw1lSHFM5AlojLHtDQoicoshTWsCKlM3yWVtZerRHaVDIubu0bk5RjZyjhy2UqVIluJANMdATnrCOgkX8m19lpQrOzppgF0OaSkM04TIpeJnUpXeQdeuHTVlAqPmd6cxmDcg3xlDxzv89z58f2pDz%2BTlflrMbAFjqfcDNX7ObBDX%2FZgCL1%2B4v5LHt%2FePsBwcca6RYh9HAq3BqGPA0r8CpNCPXAOUqJLU9KC5ypw8oRl6fSpUvwTin0yhglrrfCboGNT7yFBx6zeQ4LK37UeEmU4AAEcisTGrhS0jU%2BRn67s%2FKTdZLiQPc%2FKvp2WWkKNq0hnKuIOxrKx4SpKMVt8eHsYi07L9gVjqwWOFQbCRg2CtwCr1RCs6gmsHYFVZE3ZD1iVcwAqaD1X1PXeZcmDROY0XioYdZVRbW2miqZgtJmKOBdGeWAUS588dX6c45GPk%2Fk96TKtPeUgskdCXcZ0bTQcydFlehprYbFEFhZRMEF36kytsXgfrhCfUreBAen5CuVE7E9QLIX%2FWxCLJsVULAJed6qMSI9%2BSUIg0WUAIwhmPm671GVAwx05d9A4mB157%2BIhwQZclLJNkwyzNSKEUaVuxbCYNZDVKFX2FDir7m%2BRNA9q2IOilJ8U1K6E3H53WgmyFSWhE%2ByOwVqQ84bAK1SsinplrEX5FrTdWJFyTmDtRpHSeWbNhM7TMZFsNxxkrnDDsZwhkOUTyChWhcJfG9XfWWit3i4m4NAOiqgqttMmo5mP%2FRZBV7SvmY%2F4IB343GE7UQLV41YCC0qTrgTKiNMVC2N8rF7BwifGbWvMMpDt6SLGtdWhZkryFurpbByWkYs1tdcZOEZXeBLpS%2B39hVpy33siX4VCR2wuTGYeBGxGS5TxEmI0iEaDNz4RmlnDFucITtjzGYWziT%2Btu%2F%2BAfKGbVjxkKhZ3N4pwKY8pyJJd61SzKfApGQmuNzYGcDpDqb1xWcu7ZUVgmeUNRWDfBlNcsUIuoZknKsCq2ikJzCi9V%2FIBLtcUet76XFnfV2dgxmAYeQsuMRaOSr6c%2Bop%2BbjDfWFpqxUc6omZB%2Boe24zVqZ6uhbdyxVSgh8530k08U5hQNZ5KeQe1%2FEJVV7K7SYyMUXQKDi40ICjclL%2FvmjnwSao0C%2Bd5Vb8FqasuVfnOHeMbU%2FZt96PSl%2FkXqWdmEoxna2lkUnZCvMl92Z71sPKU7s%2FMwwp3GngM1tfP0OK9yjeWOrs2SvEvwzvHZ1h7extuuPQqVpgykHxxcuZBQ1qxzgHZJIVoLRewA0MoY0a3maCWaZoWFAVA3ZuEt2FR7qTju6SxbGlpLIKtMYKLGXl8q6VyUdFlhukyXzMotQTHZj9y4RH6Nq6zTVyE8DN43JjdNnuxTB2%2BfYi%2F6tQCv3BQXZu%2FmSMDgwyO3Mk%2B1tpPnBRnTk3rkAW3Fgt5GIRZiRoaF%2FO2j%2Fw5%2BjS1jcTf4Z%2Fj9eubOhwcU8VE9GlfXn42XvKRMRyvLEdUYkN24SRlNvegPRyCg%2BNPbnq%2BzArHW0FF50%2B2fkEa1IZNKX93uzHxc8JcYhrPRyQt6m2uwoWt7mmhjJvq%2FbniSNmaVCeksLtavC6tTOrtS3RDZCHZ%2BZp4c8tSd7SQbat2hzt9kiSKvLtfNfflsXNTWO7S870w1jvyW64JSpEeDSvnhCKFwcADeods63JUkiTYm900NrLUSQM4E%2B5cA8g3WqLKlzpJgY0usytgWuvKU7uka4yud%2FxbGyq6ZnP1u0xKKbXcvdpi8NE5EAXwyBhx85JXBGpBsAXmLXJ%2FUzn71x1QPQeboT6cIxsklqLOSOCCSBt5HMCjn0US1zfwZrsv0nQxO9DhwYeyVs6qiu22RG4XeYNG8xC3yGuW78cM5RrPsglqvlNla9ekD0hUXeZXMQu%2BbAMFwQNYLwuyQHrH4ZDZfkxs6H0qR%2Br0rPLgdOrc%2FPsx%2FfgWDsfpVAU1sK%2FsLnQHnpm1WhSoAau0mtdKeZMtKY7kqx8fhyFWMAGG1tbSwZ49mdyeGQhSLfu5iT0pAYttbSv4UtHotaFsbGFvhWDiITWF8OHGUOWzbHg8yqC0cPnaEWl51DdLr70%2BidHvzHUAaMkWiNEA2IPqRHFHaZpU7R%2BD2LbrKXcq5mhBMtZE2Xd5hsOp0LsPzmjsMWIFcUi9l3Lyb%2FRJo865Xvlj0u3vHIfmuZTLpP30g40xR2OMNbzQin%2B%2FjxW26T0Vh16bDhsICOHec6l1IOqiRGOTehcQLDOuoaf%2FyQuFKo7OmthcgQhhPk3%2BV8N9J3%2FvpXf2G9tXo7WfBzyZnNpCzU8zulpLEbmJ2ew4XtStytxAdqXDunW24UQiq2h8P7FqUEP0eyJReh5Siev%2FCxB5vhGpu3nypA6ClKOC7cDfxYzwI5w%2FDhOHEY1AK3%2BtuLC7gdNbtaGeW5k6b6I8Jb60Od5TaljuPE5YcuMF8yN4e31GTebhoQLaOxG6NY%2Bji1a4FnayVJiGddXXnG0GSR7GdKWaXEB90qBpKdZHtO56zm8HddtaK7TQd2jy4s%2FK1G4Zrrogg3b5LEkDQ8FMu6EoZ%2FGQ9aEoLposg1I5WjGo3GaxU%2BTytmGNdMe1AsOmKQU9Tn6gru1syx2FRWqvYbuWlLvREk2FSur%2Ftf1YnN8%2B%2F54ur9%2B67S%2B3p%2Bo%2FgKPWamvNBKs2dlPFtfsdulBrvOWVcMzVHk%2BSVqzDOYcWpe9kwZYgwJcNBRogp3r7DqGFtfl15U5v2Nk3SK7s2bVK8YF4owa1li61M5iIwynAV6d3HwSJ%2B%2BOD%2BHH9WlH%2FuPt0N7nqiwK0uD9m9j9nsJWwneiEpYnclcbw4uzbLX6rW8ob%2FnsI43PZYUElyk%2BV7XBcEu22BnuKozErYzkm2N%2Fj04%2BPtl1sQvfnm672%2F3zx%2Fvdx5xNqGSyU%2FPzrbwNlk5TIpHxOtY7qDWSY9zm26rddTtZ6GRz%2BN10jRPUvci2qzsvAslMYPIMhieU99BbXUH3DHtyocDpZtlt%2F0tmjmf5nDlI3ooiVDZ1sytgExeYyjROxcZicaxeQm8lCS4z8%3D)

In [16]:
__author__ = "Zahra Honarvar, Farzaneh Soltanzadeh, Ali Mousavi, Milad Nooraei, Mohamad Ghafaripour"
__email__ = "Zhpica@gmail.com, f.soltanzadeh.f@gmail.com, ali.mousavi4878@gmail.com, miladnooraiy0@gmail.com"
__mentor__ = "Diba Aminshahidi"
__organization__ = "Quera"
__date__ = "2023-05-29"

IMPORT LIBRARIES üìö

In [17]:
from sqlalchemy import create_engine
from sqlalchemy import URL
from sqlalchemy import text
from urllib.parse import quote_plus
from sqlalchemy.types import Integer, VARCHAR, CHAR
from sqlalchemy import ForeignKeyConstraint
import pandas as pd

Connection and CREATE SCHEMA üìù

In [18]:
url_object = URL.create(
    "mysql+mysqlconnector",
    username="root",
    password="farzansql",
    host="localhost",
)

In [19]:
engine = create_engine(url_object)

In [20]:
with engine.connect() as conn : 
    conn.execute(text('CREATE Schema football;'))
    # conn.execute(text('DROP Schema football;'))

Read Clubs Data üìó

In [22]:
df_club = pd.read_csv('Phase1\data\club.csv', index_col=0)
df_club_players = pd.read_csv('Phase1\data\club_players.csv', index_col=0)
df_league_goals = pd.read_csv('Phase1\data\league_goals.csv', index_col=0)

Read Players Data üìó

In [23]:
df_players_data = pd.read_csv('Phase1\data\players_data.csv', index_col=0)
df_players_stats = pd.read_csv('Phase1\data\players_stats.csv', index_col=0)
df_players_transfers = pd.read_csv('Phase1\data\players_transfers.csv', index_col=0)

CREATE TABLE Country ‚öΩÔ∏è

In [24]:
table_country = df_club.loc[:, ['CountryID', 'Country']].drop_duplicates()
table_country = table_country.rename(columns={'CountryID': 'country_id', 'Country': 'country_name'}).set_index('country_id')
table_country

           country_name
country_id
189             England
40              Germany
75                Italy
50               France
157               Spain

In [25]:
with engine.connect() as conn:
    table_country.to_sql(name='country', con=conn, schema='football', if_exists='replace', chunksize=50, method='multi',
                          index_label= 'country_id', dtype={'country_id': Integer(), 'country_name': VARCHAR(15)})

CREATE TABLE League ‚öΩÔ∏è

In [26]:
table_league = df_club.loc[:, ['League', 'CountryID']].drop_duplicates().assign(league_id=range(1, 6)).set_index('league_id')
table_league = table_league.rename(columns={'League': 'league_name', 'CountryID': 'country_id'})
table_league

              league_name  country_id
league_id
1          Premier League         189
2              Bundesliga          40
3                 Serie A          75
4                 Ligue 1          50
5                  LaLiga         157

In [27]:
query_league = text("""
CREATE TABLE league (
league_id INT NOT NULL AUTO_INCREMENT,
league_name VARCHAR(30) NOT NULL,
country_id INT NOT NULL,
PRIMARY KEY (league_id),
FOREIGN KEY (country_id) REFERENCES country(country_id)
);""")

In [28]:
with engine.connect() as conn:
    conn.execute(text('USE football;'))
    conn.execute(query_league)

In [29]:
with engine.connect() as conn:
    table_league.to_sql(name='league', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Club ‚öΩÔ∏è

In [30]:
table_club = df_club.loc[:, ['ClubID', 'Club', 'Stadium', 'StadiumCap']].drop_duplicates()
table_club = table_club.rename(columns={'ClubID': 'club_id', 'Club': 'club_name', 'Stadium': 'stadium_name', 'StadiumCap': 'stadium_capacity'}).set_index('club_id')
table_club.head(3)

               club_name      stadium_name stadium_capacity
club_id
631           Chelsea FC   Stamford Bridge     40.853 Seats
281      Manchester City    Etihad Stadium     55.017 Seats
11            Arsenal FC  Emirates Stadium     60.704 Seats

In [31]:
with engine.connect() as conn:
    table_club.to_sql(name='club', con=conn, schema='football', if_exists='replace', chunksize=50, method='multi',
                          index_label= 'club_id', dtype={'club_id': Integer(), 'club_name': VARCHAR(30), 
                                                         'stadium_name': VARCHAR(50), 'stadium_capacity': VARCHAR(20)})

CREATE TABLE Season ‚öΩÔ∏è

In [32]:
table_season = df_club.loc[:, ['Season']].drop_duplicates()
table_season = table_season.assign(season_id=range(1, len(table_season) + 1)).set_index('season_id').rename(columns={'Season': 'year'})
table_season

           year
season_id
1          2015
2          2016
3          2017
4          2018
5          2019
6          2020
7          2021

In [33]:
with engine.connect() as conn:
    table_season.to_sql(name='season', con=conn, schema='football', if_exists='replace', chunksize=50, method='multi',
                          index_label= 'season_id', dtype={'season_id': Integer(), 'year': Integer()})

CREATE TABLE Season_info ‚öΩÔ∏è

In [34]:
league_dict = dict(zip(table_league['league_name'], table_league.index))
league_dict

{'Premier League': 1, 'Bundesliga': 2, 'Serie A': 3, 'Ligue 1': 4, 'LaLiga': 5}

In [35]:
season_dict = dict(zip(table_season['year'], table_season.index))
season_dict

{2015: 1, 2016: 2, 2017: 3, 2018: 4, 2019: 5, 2020: 6, 2021: 7}

In [36]:
table_season_info = df_club.loc[:, ['Season', 'League', 'ClubID', 'Rank', 'Squad', 
                                    'avgAge', 'Foreigners', 'avgMarketValue', 'totalMarketValue', 
                                    'Club_income', 'Club_expenditure', 'Club_OverallBalance']]
                                    
table_season_info['League'] = table_season_info['League'].map(league_dict)
table_season_info['Season'] = table_season_info['Season'].map(season_dict)

table_season_info = table_season_info.rename(columns={'Season': 'season_id', 'League': 'league_id', 'ClubID': 'club_id',
                          'Rank': 'club_rank', 'Squad': 'squad', 'avgAge': 'avg_age',
                          'Foreigners': 'foreign_players', 'avgMarketValue': 'avg_marketValue',
                          'totalMarketValue': 'total_marketValue', 'Club_income': 'income',
                          'Club_expenditure': 'expenditure', 'Club_OverallBalance': 'overbalance'})

table_season_info = table_season_info.assign(season_info_id=range(1, len(table_season_info)+1)).set_index('season_info_id')
table_season_info.head(3)

,season_id,league_id,club_id,club_rank,squad,avg_age,foreign_players,avg_marketValue,total_marketValue,income,expenditure,overbalance
season_info_id,,,,,,,,,,,,
1,1,1,631,10.0,40,24.7,31,‚Ç¨13.84m,‚Ç¨553.50m,‚Ç¨87.49m,‚Ç¨96.50m,‚Ç¨-9.01m
2,1,1,281,4.0,38,25.4,27,‚Ç¨13.14m,‚Ç¨499.35m,‚Ç¨67.44m,‚Ç¨208.47m,‚Ç¨-141.03m
3,1,1,11,2.0,41,24.7,29,‚Ç¨11.17m,‚Ç¨457.85m,‚Ç¨2.50m,‚Ç¨26.50m,‚Ç¨-24.00m

In [37]:
query_season_info = text("""
CREATE TABLE season_info (
season_info_id INT NOT NULL AUTO_INCREMENT,
season_id INT NOT NULL,
league_id INT NOT NULL,
club_id INT NOT NULL,
club_rank INT,
squad INT,
avg_age FLOAT,
foreign_players INT,
avg_marketValue VARCHAR(12),
total_marketValue VARCHAR(12),
income VARCHAR(12),
overbalance VARCHAR(12),
expenditure VARCHAR(12),
PRIMARY KEY (season_info_id),
FOREIGN KEY (season_id) REFERENCES season(season_id),
FOREIGN KEY (league_id) REFERENCES league(league_id),
FOREIGN KEY (club_id) REFERENCES club(club_id)
);""")

In [38]:
with engine.connect() as conn:
    conn.execute(text('USE football;'))
    conn.execute(query_season_info)

In [39]:
with engine.connect() as conn:
    table_season_info.to_sql(name='season_info', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE League_Goals ‚öΩÔ∏è

In [40]:
table_league_goals = df_league_goals.copy()
table_league_goals['League'] = table_league_goals['League'].map(league_dict)
table_league_goals['Season'] = table_league_goals['Season'].map(season_dict)

table_league_goals = table_league_goals.assign(id=range(1, len(table_league_goals)+1)).set_index('id')
table_league_goals.rename(columns={'League': 'league_id', 'Season': 'season_id', 'Goals': 'goals'}, inplace=True)
table_league_goals.head(3)

    league_id  season_id  goals
id
1           1          1   1026
2           1          2   1064
3           1          3   1018

In [41]:
query_league_goals = text("""
CREATE TABLE league_goals (
id INT NOT NULL AUTO_INCREMENT,
league_id INT NOT NULL,
season_id INT NOT NULL,
goals INT,
PRIMARY KEY (id),
FOREIGN KEY (league_id) REFERENCES league(league_id),
FOREIGN KEY (season_id) REFERENCES season(season_id)
);""")

In [42]:
with engine.connect() as conn:
    conn.execute(text('USE football;'))
    conn.execute(query_league_goals)

In [43]:
with engine.connect() as conn:
        table_league_goals.to_sql(name='league_goals', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Coach ‚öΩÔ∏è

In [44]:
table_coach = df_club['Coach'].str.split(';')
table_coach = pd.DataFrame(table_coach.explode('Coach')).drop_duplicates().reset_index(drop=True)
table_coach = table_coach.assign(coach_id=range(1, len(table_coach) + 1)).set_index("coach_id").rename(columns={"Coach": "coach_name"})
table_coach.head(3)

                 coach_name
coach_id
1             Jos√© Mourinho
2              Guus Hiddink
3         Manuel Pellegrini

In [45]:
with engine.connect() as conn:
    table_coach.to_sql(name='coach', con=conn, schema='football', if_exists='replace', chunksize=50, method='multi',
                          index_label= 'coach_id', dtype={'coach_id': Integer(), 'coach_name': VARCHAR(40)})

CREATE TABLE Coach_Season_info ‚öΩÔ∏è

In [46]:
table_coach_season_info = df_club.loc[: , ["Coach", "Season"]].assign(season_info_id=range(1, len(df_club) + 1)).set_index("season_info_id")
table_coach_season_info['Coach'] = table_coach_season_info['Coach'].str.split(';')
table_coach_season_info = table_coach_season_info.explode('Coach')

table_coach_season_info.rename(columns={"Coach": "coach_name"}, inplace=True)
table_coach_season_info.drop('Season', axis=1, inplace=True)
table_coach_season_info = table_coach_season_info.assign(id=range(1, len(table_coach_season_info) + 1)).reset_index().set_index("id")
table_coach_season_info.head(3)

    season_info_id         coach_name
id
1                1      Jos√© Mourinho
2                1       Guus Hiddink
3                2  Manuel Pellegrini

In [47]:
coach_dict = dict(zip(table_coach['coach_name'], table_coach.index))
# coach_dict

In [48]:
table_coach_season_info['coach_name'] = table_coach_season_info['coach_name'].map(coach_dict)
table_coach_season_info.rename(columns={'coach_name': 'coach_id'}, inplace=True)
table_coach_season_info.head(3)

    season_info_id  coach_id
id
1                1         1
2                1         2
3                2         3

In [49]:
query_coach_season_info = text("""
CREATE TABLE coach_season_info (
id INT NOT NULL AUTO_INCREMENT,
season_info_id INT NOT NULL,
coach_id INT NOT NULL,
PRIMARY KEY (id),
FOREIGN KEY (season_info_id) REFERENCES season_info(season_info_id),
FOREIGN KEY (coach_id) REFERENCES coach(coach_id)
);""")

In [50]:
with engine.connect() as conn:
    conn.execute(text('USE football;'))
    conn.execute(query_coach_season_info)

In [51]:
with engine.connect() as conn:
    table_coach_season_info.to_sql(name='coach_season_info', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Victories ‚öΩÔ∏è

In [52]:
table_victories = df_club['Club_victories'].str.split(';')
table_victories = pd.DataFrame(table_victories.explode('Club_victories')).drop_duplicates().dropna().reset_index(drop=True)

table_victories = table_victories.assign(victory_id=range(1, len(table_victories) + 1)).set_index("victory_id")
table_victories.rename(columns={'Club_victories': 'victory_name'}, inplace=True)
table_victories.head(3)

                            victory_name
victory_id
1           Champions League Participant
2              English League Cup winner
3                English Supercup Winner

In [53]:
with engine.connect() as conn:
    table_victories.to_sql(name='victories', con=conn, schema='football', if_exists='replace', chunksize=50, method='multi',
                          index_label= 'victory_id', dtype={'victory_id': Integer(), 'victory_name': VARCHAR(50)})

CREATE TABLE Victories_Season_info ‚öΩÔ∏è

In [54]:
table_victories_season_info = df_club.loc[:, ["Club_victories", "Season"]].assign(season_info_id=range(1, len(df_club) + 1))
table_victories_season_info = table_victories_season_info.dropna(subset='Club_victories').reset_index(drop=True)
table_victories_season_info.head(3)

                                      Club_victories  Season  season_info_id
0                       Champions League Participant    2015               1
1  English League Cup winner;Champions League Par...    2015               2
2  Champions League Participant;English Supercup ...    2015               3

In [55]:
table_victories_season_info['Club_victories'] = table_victories_season_info['Club_victories'].str.split(';')
table_victories_season_info = table_victories_season_info.explode('Club_victories')

table_victories_season_info.rename(columns={"Club_victories": "victory_name"}, inplace=True)
table_victories_season_info.drop('Season', axis=1, inplace=True)
table_victories_season_info = table_victories_season_info.assign(id=range(1, len(table_victories_season_info) + 1)).reset_index(drop=True).set_index("id")
table_victories_season_info.head(3)

                    victory_name  season_info_id
id
1   Champions League Participant               1
2      English League Cup winner               2
3   Champions League Participant               2

In [56]:
victories_dict = dict(zip(table_victories['victory_name'], table_victories.index))
# victories_dict

In [57]:
table_victories_season_info['victory_name'] = table_victories_season_info['victory_name'].map(victories_dict)
table_victories_season_info.rename(columns={'victory_name': 'victory_id'}, inplace=True)
table_victories_season_info.head(3)

    victory_id  season_info_id
id
1            1               1
2            2               2
3            1               2

In [58]:
query_victories_season_info = text("""
CREATE TABLE victories_season_info (
id INT NOT NULL AUTO_INCREMENT,
season_info_id INT NOT NULL,
victory_id INT NOT NULL,
PRIMARY KEY (id),
FOREIGN KEY (season_info_id) REFERENCES season_info(season_info_id),
FOREIGN KEY (victory_id) REFERENCES victories(victory_id)
);""")

In [59]:
with engine.connect() as conn:
    conn.execute(text('USE football;'))
    conn.execute(query_victories_season_info)

In [60]:
with engine.connect() as conn:
        table_victories_season_info.to_sql(name='victories_season_info', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Positions ‚öΩÔ∏è

In [61]:
table_positions = df_club_players.loc[:, ['Player_possition']].drop_duplicates().rename(columns={'Player_possition': 'position_name'})
table_positions = table_positions.assign(position_id=range(1, len(table_positions) + 1)).set_index('position_id')
table_positions.head(3)

            position_name
position_id
1              Goalkeeper
2             Centre-Back
3               Left-Back

In [62]:
with engine.connect() as conn:
    table_positions.to_sql(name='positions', con=conn, schema='football', if_exists='replace', chunksize=50, method='multi',
                          index_label= 'position_id', dtype={'position_id': Integer(), 'position_name': VARCHAR(20)})

CREATE TABLE Players ‚öΩÔ∏è

In [63]:
table_players = df_players_data[["given_name", "full_name", "date_of_birth", "citizenship", "place_of_birth", "foot", "height"]]
table_players.head(3)

,given_name,full_name,date_of_birth,citizenship,place_of_birth,foot,height
player_id,,,,,,,
465955,Marcin Bulka,Marcin Bu≈Çka,"Oct 4, 1999",Poland,P≈Çock,right,199.0
2998,Robert Huth,NaN,"Aug 18, 1984",Germany,Berlin,NaN,NaN
406633,Nya Kirby,Nya Jerome Kirby,"Jan 31, 2000",England,London,right,174.0

In [64]:
with engine.connect() as conn:
    table_players.to_sql(name="players", con=conn, schema="football", if_exists="replace", chunksize=50, method="multi",
                          index_label="player_id", dtype= {"player_id" : Integer(), "given_name" : VARCHAR(40), "full_name" : VARCHAR(70),
                                                           "date_of_birth" : VARCHAR(15), "citizenship" : VARCHAR(30), "place_of_birth" : VARCHAR(40),
                                                           "foot" : VARCHAR(6), "height" : Integer()})

CREATE TABLE Players_Season_info ‚öΩÔ∏è

In [65]:
table_players_season_info = df_club_players.loc[:, ['PlayerID', 'Player_MarketValue', "Season", "ClubID", "Player_possition"]].drop_duplicates()
table_players_season_info.head(3)

   PlayerID Player_MarketValue  Season  ClubID Player_possition
0    108390           ‚Ç¨35.00m¬†    2015     631       Goalkeeper
1     33873           ‚Ç¨12.00m¬†    2015     631       Goalkeeper
2    128898             ‚Ç¨250k¬†    2015     631       Goalkeeper

In [66]:
grouped_players_season_info = table_players_season_info.groupby(by=["Season", "ClubID"], sort=False)
season_info_id = 0

for (Season,ClubID), group in grouped_players_season_info:
    season_info_id += 1
    for PlayerID in group["PlayerID"]:
        table_players_season_info.loc[(table_players_season_info["PlayerID"] ==  PlayerID) &
                                     (table_players_season_info["Season"] ==  Season) & 
                                     (table_players_season_info["ClubID"] ==  ClubID), "season_info_id"] = season_info_id

table_players_season_info.head(3)

,PlayerID,Player_MarketValue,Season,ClubID,Player_possition,season_info_id
0,108390,‚Ç¨35.00m,2015,631,Goalkeeper,1.0
1,33873,‚Ç¨12.00m,2015,631,Goalkeeper,1.0
2,128898,‚Ç¨250k,2015,631,Goalkeeper,1.0

In [67]:
position_dict = dict(zip(table_positions['position_name'], table_positions.index))
# position_dict

In [68]:
table_players_season_info['Player_possition'] = table_players_season_info['Player_possition'].map(position_dict)

table_players_season_info = table_players_season_info.drop(["Season", "ClubID"], axis=1).rename(columns={"PlayerID": "player_id","Player_MarketValue": "player_market_value", 'Player_possition': 'position_id'})
table_players_season_info = table_players_season_info.assign(id=range(1, len(table_players_season_info) + 1)).set_index('id')

table_players_season_info.head(3)

    player_id player_market_value  position_id  season_info_id
id
1      108390            ‚Ç¨35.00m¬†            1             1.0
2       33873            ‚Ç¨12.00m¬†            1             1.0
3      128898              ‚Ç¨250k¬†            1             1.0

In [69]:
query_players_season_info = text("""
CREATE TABLE players_season_info (
id INT NOT NULL AUTO_INCREMENT,
season_info_id INT NOT NULL,
player_id INT NOT NULL,
position_id INT NOT NULL,
player_market_value VARCHAR(12),
PRIMARY KEY (id),
FOREIGN KEY (season_info_id) REFERENCES season_info(season_info_id),
FOREIGN KEY (player_id) REFERENCES players(player_id),
FOREIGN KEY (position_id) REFERENCES positions(position_id)
);""")

In [70]:
with engine.connect() as conn:
    conn.execute(text('USE football;'))
    conn.execute(query_players_season_info)

In [71]:
with engine.connect() as conn:
    table_players_season_info.to_sql(name='players_season_info', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Outfitters ‚öΩÔ∏è

In [72]:
table_outfitter = df_players_data[["outfitter"]]
table_outfitter = table_outfitter.dropna(subset='outfitter').reset_index()
table_outfitter = table_outfitter.assign(id=range(1, len(table_outfitter) + 1)).set_index('id')

table_outfitter.head(3)

    player_id outfitter
id
1       84481      Nike
2      120630      Nike
3      587002    adidas

In [73]:
query_outfitter = text("""
CREATE TABLE outfitter(
id INT NOT NULL AUTO_INCREMENT,
player_id INT NOT NULL,
outfitter VARCHAR(15),
PRIMARY KEY (id),
FOREIGN KEY(player_id) REFERENCES players(player_id)
);""")

In [74]:
with engine.connect() as conn:
    conn.execute(text('use football;'))
    conn.execute(query_outfitter)

In [75]:
with engine.connect() as conn:
    table_outfitter.to_sql(name='outfitter', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Player_info ‚öΩÔ∏è

In [76]:
table_player_info = df_players_data.reset_index()[["player_id", "shirt_number", "caps", "goals", "agent", "current_club", "date_of_last_contract", "contract_Joined",'contract_expires']]
table_player_info['id'] = range(1, len(table_player_info) + 1)
table_player_info.set_index("id", inplace = True)
table_player_info.head(2)

,player_id,shirt_number,caps,goals,agent,current_club,date_of_last_contract,contract_Joined,contract_expires
id,,,,,,,,,
1,465955,#90,1.0,0.0,AIS Football,OGC Nice,NaN,"Jul 1, 2022","Jun 30, 2026"
2,2998,NaN,19.0,2.0,Christian Nilles,Retired,NaN,"Jul 1, 2018",-

In [77]:
query_player_info = text("""
CREATE TABLE player_info (
id INT NOT NULL AUTO_INCREMENT,
player_id INT NOT NULL,
shirt_number VARCHAR(4),
caps INT,
goals INT,
agent VARCHAR(40),
current_club VARCHAR(50),
date_of_last_contract VARCHAR(15),
contract_joined VARCHAR(15),
contract_expires VARCHAR(15),
PRIMARY KEY (id),
FOREIGN KEY(player_id) REFERENCES players(player_id)
);""")

In [78]:
with engine.connect() as conn:
    conn.execute(text('use football;'))
    conn.execute(query_player_info)

In [79]:
with engine.connect() as conn:
    table_player_info.to_sql(name='player_info', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Stats ‚öΩÔ∏è

In [80]:
 df_players_stats.head(1)

,name,appearances,goals,asists,yellow_cards,second_yellow_cards,red_cards,minutes_played,goals_conceded,clean_sheets
id,,,,,,,,,,
465955,marcin-bulka,6,-,NaN,-,-,-,540',3,3

In [81]:
table_stats = df_players_stats.rename_axis('player_id')
table_stats = table_stats.assign(id=range(1, len(table_stats) + 1)).reset_index().set_index('id')
table_stats = table_stats[['player_id','appearances','goals','asists','yellow_cards','second_yellow_cards','red_cards','minutes_played','goals_conceded','clean_sheets']]
table_stats.head(2)

,player_id,appearances,goals,asists,yellow_cards,second_yellow_cards,red_cards,minutes_played,goals_conceded,clean_sheets
id,,,,,,,,,,
1,465955,6,-,NaN,-,-,-,540',3,3
2,2998,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [82]:
query_stats = text("""
CREATE TABLE stats (
id INT NOT NULL AUTO_INCREMENT,
player_id INT NOT NULL,
appearances VARCHAR(5),
goals VARCHAR(3),
asists VARCHAR(3),
yellow_cards VARCHAR(2),
second_yellow_cards VARCHAR(2),
red_cards VARCHAR(2),
minutes_played VARCHAR(7),
goals_conceded VARCHAR(5),
clean_sheets VARCHAR(5),
PRIMARY KEY (id),
FOREIGN KEY(player_id) REFERENCES players(player_id)
);""")

In [83]:
with engine.connect() as conn:
    conn.execute(text('use football;'))
    conn.execute(query_stats)

In [84]:
with engine.connect() as conn:
    table_stats.to_sql(name='stats', con=conn, schema='football', if_exists='append', chunksize=50, method='multi')

CREATE TABLE Transfer ‚öΩÔ∏è

In [85]:
table_transfer = df_players_transfers.drop('date', axis=1).reset_index()
table_transfer = table_transfer.assign(id=range(1, len(table_transfer) + 1)).set_index('id')
table_transfer.rename(columns = {"season" : "transfer_date", 'left': 'club_left', 'joined': 'club_joined'}, inplace = True)
table_transfer.head(3)

,player_id,transfer_date,club_left,club_joined,mv,fee
id,,,,,,
1,465955,21/22,Paris SG,OGC Nice,‚Ç¨800k,loan transfer
2,465955,20/21,LB Ch√¢teauroux,Paris SG,‚Ç¨800k,End of loan
3,465955,20/21,Paris SG,LB Ch√¢teauroux,‚Ç¨900k,loan transfer

In [86]:
query_transfer = text("""
CREATE TABLE transfer (
id INT NOT NULL,
player_id INT NOT NULL,
transfer_date VARCHAR(15),
club_left VARCHAR(30),
club_joined VARCHAR(30),
mv VARCHAR(15),
fee VARCHAR(25),
PRIMARY KEY (id),
FOREIGN KEY (player_id) REFERENCES players(player_id)
);""")

In [87]:
with engine.connect() as conn:
    conn.execute(text('USE football;'))
    conn.execute(query_transfer)

In [88]:
with engine.connect() as conn:
    table_transfer.to_sql(name="transfer", con=conn, schema="football", if_exists="append", chunksize=50, method="multi")